{
    "title": "Competitions Quebec",
    "host": "hosted by",
    "lien": "Link :",
    "location": "Location:",
    "début": "Start:",
    "deadline": "Registration deadline:",
    "langue": "Language(s):",
    "type": "Competition type:",
    "language": "FR",
    "ressources": "Resources",
    "soumettre": "+ Competition",
    "link": "https://docs.google.com/forms/d/e/1FAIpQLSfsu9-K2xY4s_DA3ICfbf8NN8bDi-3mHjBFFmILM-bLRNCrYg/viewform?embedded=true",
    "about": "About this website",
    "aboutText": "Welcome to Competitions Quebec! As a fellow Quebec student, I sometimes find it hard to get informations about competitions related to computer science, whether it is hackathons, gamejams, CTFs or event others like the CS Games or JDIS Games. I believe that participation in these events can be a gateway to valuable skills, connections, and experiences. Hopefully this platform will be a guide through where to start and encourage more students to participate.",
    "hackathonText": "A hackathon is an intensive time-bound event where teams come together to collaborate and create innovative solutions to specific challenges or projects. Typically lasting 24 or 36 hours, hackathons are the perfect opportunity to focus on learning a specific technology. You are sometimes given a problematic or a theme, and you have to come up and build a complete project from scratch.",
    "hackathonTextMore": "If you are looking for more hackathons, you can also check out the following websites:",
    "hackathonList1": ": for worldwide, online and/or long-duration hackathons",
    "hackathonList2": ": for more local, hybrid hackathons",
    "ctfText": "A Capture The Flag (CTF) competition is a cybersecurity challenge where participants, sometimes in teams, a cybersecurity simulation. The objective is to find and exploit security vulnerabilities, solve puzzles, and recover hidden pieces of information, known as \"flags.\" CTFs are designed to test and improve the participants' hacking and defensive skills, spanning a wide range of cybersecurity domains, such as web security, cryptography, reverse engineering, and more.",
    "ctfTextMore": "More websites for CTFs:",
    "ctfList1": ": to practice CTF beginner-friendly challenges",
    "ctfList2": ": to practice CTF advanced challenges",
    "ctfList3": ": to see all online CTFs happening around the world",
    "ctfList4": ": to learn more about cybersecurity in general",
    "ctfList5": ": to participate in a monthly CTF solving workshop (in Montreal)",
    "gamejamText" : "Similar to a hackathon, a GameJam is a creative event where game developers, designers, and enthusiasts gather to collaboratively create video games within a constrained period, often lasting anywhere from a few days to a couple of weeks. During a game jam, participants work intensively to design and build games based on a specific theme or set of constraints. It's an opportunity for individuals to showcase their game development skills, experiment with new ideas, and embrace the constraints of time and resources to produce innovative and often unique games.",
    "othersText" : "The best category in my opnion. The competitions here are so diverse and original that it's hard to describe them all. Some notable examples inlude:",
    "othersList1" : " : A real tradition in certain univesrities, the CS Games is a technical and social computer competition where teams of about ten students from North American universities compete to win the CS Cup. During the three days of the event, there are various 3 to 6-hour competitions covering various computer science domains, a continuous \"Puzzle Hero\" challenge, extravagant parties, sponsors, and an incredible atmosphere!",
    "othersList2" : " : In this day-long competition, the goal is to program a bot to make it play (and win?) in a video game specially designed for the occasion"
}