{
    "title": "Compétitions Québec",
    "host": "organisé par",
    "lien": "Lien :",
    "location": "Lieu :",
    "début": "Début :",
    "deadline": "Date limite d'inscription :",
    "langue": "Langue(s) :",
    "type": "Type de compétition :",
    "language": "EN",
    "ressources": "Ressources",
    "soumettre": "+ Compétition",
    "link": "https://docs.google.com/forms/d/e/1FAIpQLSdlQLGXzv2ff-jzZAylTaHnnSBtRz8HXQZfPscD-28u08GRWA/viewform?embedded=true",
    "about": "A propos du site",
    "aboutText": "Bienvenue sur Compétitions Québec ! En tant qu'étudiante aussi, je trouve qu'il est parfois difficile de trouver des informations sur les compétitions d'informatique, que ce soit des hackathons, des gamejams, des CTFs ou même d'autres événements comme les CS Games ou les JDIS Games. Je pense que la participation à ces événements peut être une porte d'entrée vers des apprentissages, des connexions et des expériences précieuses, alors j'espère que cette plateforme servira de guide pour de commencement et encouragera davantage d'étudiants à y participer.",
    "hackathonText": "Un hackathon est un événement intensif et limité dans le temps où les participants, en équipe, se réunissent pour collaborer et créer des solutions innovantes à des défis ou des projets spécifiques. Généralement d'une durée de 24 à 36 heures, un hackathon est l'occasion idéale pour se concentrer sur l'apprentissage d'une technologie spécifique. Un thème ou une problèmatique sont parfois donnés, le but est alors de construire un projet de a à z.",
    "hackathonTextMore": "Plus de ressources pour les hackathons :",
    "hackathonList1": ": pour des hackathons en ligne à l'échelle mondiale, ou d'une durée plus longue",
    "hackathonList2": ": pour des hackathons hybrides relativement locaux",
    "ctfText": "Une compétition Capture The Flag (CTF) est un défi en cybersécurité où les participants, parfois en équipes, s'affrontent afin de trouver un maximum de flags à travers l'exploitation de vulnérabilité de sécurité, la résolution d'énigmes et la récupération d'informations cachées. Les CTF sont conçus pour tester et améliorer les compétences en piratage et en défense des participants, et couvre un large éventail de domaines de la cybersécurité, tels que le Web, la cryptographie, la rétro-ingénierie, et bien plus encore.",
    "ctfTextMore": "Plus de ressources pour les CTFs :",
    "ctfList1": " : pour pratiquer des challenges de niveau débutant",
    "ctfList2": " : pour pratiquer des challenges de plus haut niveau",
    "ctfList3": " : pour voir et participer aux CTFs à échelle mondiale",
    "ctfList4": " : pour apprendre des trucs de cybersécurité en général",
    "ctfList5": " : pour participer à un atelier mensuel de résolution de challenge (à Montréal)",
    "gamejamText" : "Similaire à un hackathon, un GameJam est un événement créatif où les développeurs de jeux, les concepteurs et les passionnés de jeux vidéo se réunissent pour créer collaborativement des jeux vidéo dans une période limitée, souvent allant de quelques jours à quelques semaines. Pendant un GameJam, les participants travaillent intensivement pour concevoir et créer des jeux vidéo basés sur un thème spécifique ou un ensemble de contraintes. C'est l'occasion pour les individus de mettre en valeur leurs compétences en développement de jeux, d'expérimenter de nouvelles idées et de se confronter à des contraintes de temps et de ressources pour produire des projets innovants et souvent uniques.",
    "othersText" : "La meilleure catégorie selon moi. Les compétitions ici sont tellement diverses et originales qu'il serait difficile de toutes les décrire, mais voici quelques exemples notables :",
    "othersList1" : " : Véritable tradition dans certaines universités, les CS Games sont une compétition d’informatique technique et sociale où des équipes d’une dizaine d’étudiants d’universités nord-américaines s’affrontent pour remporter la CS Cup. Au programme durant les trois jours de l’événement : des compétitions de 3 à 6 heures touchant tous les domaines informatiques, un challenge \"Puzzle Hero\" en continu, des partys démesurés, des sponsors et une ambiance d’enfer ! ",
    "othersList2" : " : Dans cette compétition d'une durée d'une journée, le but est de programmer un bot pour le faire jouer (et gagner ?) à un jeu vidéo spécialement conçu pour l'occasion."
}